reversable-computing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-05 Mon 15:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Reversable Computing</title>
<meta name="author" content="Dylan Poucher" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css"/><link href="https://fonts.googleapis.com/css2?family=Ibarra+Real+Nova&display=swap" rel="stylesheet">
<div class="navbar"><a href="index.html">Home</a> | <a href="about.html">About</a></div>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Reversable Computing
<br />
<span class="subtitle">How to save the universe</span>
</h1>
